# 누락값 처리하기

In [11]:
import numpy as np
import pandas as pd

In [190]:
# 넘파이 모듈중에서 누락값에 관련된 모듈 import
from numpy import NaN, NAN, nan

In [35]:
# NaN = Not A Number
# 아무것도 없다. 누락값
# False / '' / 0 비교하기
# 자기자신(NaN, nan, NAN)과도 같지 않다
# pd.isnull() 메소드와 같다. => T/F
# NaN값이 있는지 없는지? pd.isnull(값)
# 시리즈변수.isnull()
# 데이터프레임[컬럼명].isnull()

NaN == False

False

In [28]:
NaN == 0

False

In [29]:
nan == ''

False

In [30]:
NaN == NaN

False

In [31]:
pd.isnull(0)

False

In [32]:
pd.isnull(nan)

True

In [33]:
pd.isnull(NAN)

True

In [36]:
pd.isnull('파이썬')

False

In [47]:
# 누락값이 있는 시리즈 생성하기
s1 = pd.Series([NaN, 0, 100, 300])
s1.isnull()

0     True
1    False
2    False
3    False
dtype: bool

## 누락값 개수 세기

### count() 이용
- 시리즈변수.count() : 누락값제외하고 실제값 개수 카운팅
- 총 누락개수는?
    len(시리즈변수)-시리즈변수.count()
    
### np.count_nonzero() 이용
- 총 누락개수는?
    np.count_nonzero(시리즈변수, isnull())

In [55]:
s2 = pd.Series([np.nan, 0, 100, np.nan, np.nan, np.NaN, np.NAN, 600])
s2

0      NaN
1      0.0
2    100.0
3      NaN
4      NaN
5      NaN
6      NaN
7    600.0
dtype: float64

In [56]:
s2.count()

3

In [57]:
len(s2)

8

In [59]:
# 누락값만 True로 표시
s2.isnull()

0     True
1    False
2    False
3     True
4     True
5     True
6     True
7    False
dtype: bool

In [68]:
# np.count_nonzero(s2.isnull())
list1 = [0,0,0,0,1,1,1,10,1,0,0,1,1,1,1,1,0,0,0,0]
print(np.count_nonzero(list1))

10

# 누락값이 있는 데이터프레임에서 누락개수 구하기

- 데이터프레임변수.isnull()
- 데이터프레임변수.count()
- np.count_nonzero(데이터프레임변수.isnull())

In [175]:
# 데이터프레임 생성하기
df100 = pd.DataFrame(np.arange(1,21).reshape(4,5))
df100

# 특정인덱스에 누락값 넣기(np.nan) 넣기
df100.loc[0,0] = np.nan
df100.loc[1,1] = np.nan
df100.loc[2,1] = np.nan
df100.loc[3,3] = np.nan
df100

      0     1   2     3   4
0   NaN   2.0   3   4.0   5
1   6.0   NaN   8   9.0  10
2  11.0   NaN  13  14.0  15
3  16.0  17.0  18   NaN  20

In [189]:
print(df100)
print('*'*50)

print(df100.isnull())
print('*'*50)

print(df100.count())
print(df100[0].count())
print('*'*50)

print(df100)
print(np.count_nonzero(df100)) # 이거 값이 이상하다 ? 20 나와야되는데
print('*'*50)

print(np.count_nonzero(df100.isnull()))
print('*'*50)

      0     1   2     3   4
0   NaN   2.0   3   4.0   5
1   6.0   NaN   8   9.0  10
2  11.0   NaN  13  14.0  15
3  16.0  17.0  18   NaN  20
**************************************************
       0      1      2      3      4
0   True  False  False  False  False
1  False   True  False  False  False
2  False   True  False  False  False
3  False  False  False   True  False
**************************************************
0    3
1    2
2    4
3    3
4    4
dtype: int64
3
**************************************************
      0     1   2     3   4
0   NaN   2.0   3   4.0   5
1   6.0   NaN   8   9.0  10
2  11.0   NaN  13  14.0  15
3  16.0  17.0  18   NaN  20
20
**************************************************
4
**************************************************

# 누락값을 특정값으로 교체하기

- 데이터프레임명 = 데이터프레임명.fillna(대체값)
- 데이터프레임명.fillna(method)
    - ffill : NaN 값으로 되돌아가기
    - brill

In [91]:
df100

      0     1     2     3     4
0   NaN   2.0   3.0   4.0   5.0
1   6.0   NaN   8.0   9.0  10.0
2  11.0   NaN  13.0  14.0  15.0
3  16.0  17.0  18.0   NaN  20.0
5   NaN   NaN   NaN   NaN   NaN

In [100]:
# Nan을 0으로 채우기
df100 = df100.fillna(0)
df100

      0     1     2     3     4
0   0.0   2.0   3.0   4.0   5.0
1   6.0   0.0   8.0   9.0  10.0
2  11.0   0.0  13.0  14.0  15.0
3  16.0  17.0  18.0   0.0  20.0
5   0.0   0.0   0.0   0.0   0.0

In [117]:
# 컬럼에서 Nan값 다음으로 나오는 값이 NaN에 채워진다. (세로로)
df100.fillna(method='bfill')

      0     1   2     3   4
0   6.0   2.0   3   4.0   5
1   6.0  17.0   8   9.0  10
2  11.0  17.0  13  14.0  15
3  16.0  17.0  18   NaN  20

In [119]:
df100

      0     1   2     3   4
0   NaN   2.0   3   4.0   5
1   6.0   NaN   8   9.0  10
2  11.0   NaN  13  14.0  15
3  16.0  17.0  18   NaN  20

In [122]:
virus_df = pd.read_csv('../data/country_timeseries.csv')
virus_df.shape

(122, 18)

In [127]:
virus_df.head()
virus_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
Date                   122 non-null object
Day                    122 non-null int64
Cases_Guinea           93 non-null float64
Cases_Liberia          83 non-null float64
Cases_SierraLeone      87 non-null float64
Cases_Nigeria          38 non-null float64
Cases_Senegal          25 non-null float64
Cases_UnitedStates     18 non-null float64
Cases_Spain            16 non-null float64
Cases_Mali             12 non-null float64
Deaths_Guinea          92 non-null float64
Deaths_Liberia         81 non-null float64
Deaths_SierraLeone     87 non-null float64
Deaths_Nigeria         38 non-null float64
Deaths_Senegal         22 non-null float64
Deaths_UnitedStates    18 non-null float64
Deaths_Spain           16 non-null float64
Deaths_Mali            12 non-null float64
dtypes: float64(16), int64(1), object(1)
memory usage: 17.3+ KB

# 퀴즈

- 1) 데이터프레임에서 누락값의 개수는?
- 2) Deaths_Liberia 컬럼에서 누락값을 0으로 변경하여라
- 3) Deaths_UnitedStates 컬럼에서 누락값을 평균값으로 변경하여라
- 4) Cases_Spain 컬럼에서 누락값을 제외한 실제값의 개수는?

In [219]:
virus_df.shape[0]*virus_df.shape[1] - sum(virus_df.count())
np.count_nonzero(virus_df.isnull())

1214

In [143]:
# virus_df = virus_df['Deaths_Liberia'].fillna(0)
virus_df['Deaths_Liberia'].fillna(0)

0         0.0
1         0.0
2      3496.0
3      3496.0
4      3471.0
        ...
117       6.0
118       0.0
119       0.0
120       0.0
121       0.0
Name: Deaths_Liberia, Length: 122, dtype: float64

In [156]:
virus_df['Deaths_UnitedStates'] * virus_df['Deaths_UnitedStates'].isnull() == False

0      False
1      False
2      False
3      False
4      False
       ...
117    False
118    False
119    False
120    False
121    False
Name: Deaths_UnitedStates, Length: 122, dtype: bool

In [173]:
virus_df['Deaths_UnitedStates'].fillna(virus_df['Deaths_UnitedStates'].mean())

0      0.833333
1      0.833333
2      0.833333
3      0.833333
4      0.833333
         ...
117    0.833333
118    0.833333
119    0.833333
120    0.833333
121    0.833333
Name: Deaths_UnitedStates, Length: 122, dtype: float64

In [191]:
virus_df['Cases_Spain'].count()
# np.count_nonzero(virus_df['Cases_Spain']) #이거도 되야하지 않나...

122

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
       ..
117   NaN
118   NaN
119   NaN
120   NaN
121   NaN
Name: Cases_Spain, Length: 122, dtype: float64

# 누락값 삭제하기

- 시리즈변수.dropna()
- 데이터프레임[컬럼명].dropna()
- 데이터프레임.dropna()

In [203]:
virus_df.columns

Index(['Date', 'Day', 'Cases_Guinea', 'Cases_Liberia', 'Cases_SierraLeone',
       'Cases_Nigeria', 'Cases_Senegal', 'Cases_UnitedStates', 'Cases_Spain',
       'Cases_Mali', 'Deaths_Guinea', 'Deaths_Liberia', 'Deaths_SierraLeone',
       'Deaths_Nigeria', 'Deaths_Senegal', 'Deaths_UnitedStates',
       'Deaths_Spain', 'Deaths_Mali'],
      dtype='object')

In [206]:
virus_df['Deaths_Mali'].shape

(122,)

In [209]:
# 유효한 값 (NaN이 아닌 값)
virus_df['Deaths_Mali'].count()

12

In [225]:
result = virus_df['Deaths_Mali'].dropna()
len(result),len(virus_df['Deaths_Mali'])

(12, 122)

In [227]:
# 누락값이 있는 데이터에서 연산하기
# 데이터가 숫자형인 경우에는 NaN값 제외하고 연산
result2 = virus_df['Deaths_SierraLeone']/2
result2

0      1488.5
1      1471.5
2      1457.5
3         NaN
4      1413.5
        ...
117       2.5
118       NaN
119       NaN
120       NaN
121       NaN
Name: Deaths_SierraLeone, Length: 122, dtype: float64